var myDate = new Date();

function getRussianMonth() {
  //Формат. Не забываем про табуляцию.
var months = ["Января", "Февраля", "Марта", "Апреля", "Мая", "Июня", "Июля", "Августа", "Сентября", "Октября", "Ноября", "Декабря"];
return months[myDate.getMonth()];
}

function getRussianDay() {
  //табуляция.
 var days = ["Воскресенье", "Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота"];
 return days[myDate.getDay()];
}

function getMyHours(n) {
  var myHours = ["0 часов", "1 час", "2 часа", "3 часа", "4 часа", "5 часов", "6 часов", "7 часов", "8 часов", "9 часов", "10 часов", "11 часов", "12 часов", "13 часов", "14 часов",  "15 часов", "16 часов", "17 часов", "18 часов", "19 часов", "20 часов", "21 час", "22 часа", "23 часа"]
  return myHours[myDate.getHours()];
}

// Есть альтернативный вариант реализации getMyHours, без перечисления
function getMyHours() {
  var n = myDate.getHours();
  var last = n % 10;

  if (n < 10 || n > 20) {
    if (last == 1)
      return `${n} час`;
    if (last >= 2 && last < 5)
      return `${n} часа`;
  }

  return `${n} часов`;
}

// Попробуте переписать этот метод по аналогии с альтернативным вариантом getMyHours, не используя перечисление
function getMySeconds() {
  // 55 секунды -> 55 секунд
  // 60 секунд не бывает - от 0 до 59
  // https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Date/getSeconds
  var mySeconds = ["0 секунд", "1 секунда", "2 секунды", "3 секунды", "4 секунды", "5 секунд", "6 секунд", "7 секунд", "8 секунд", "9 секунд", "10 секунд", "11 секунд", "12 секунд", "13 секунд", "14 секунд", "15 секунд", "16 секунд", "17 секунд", "18 секунд", "19 секунд", "20 секунд", "21 секунда", "22 секунды", "23 секунды", "24 секунды", "25 секунд", "26 секунд", "27 секунд", "28 секунд", "29 секунд", "30 секунд", "31 секунда", "32 секунды", "33 секунды", "34 секунды", "35 секунд", "36 секунд", "37 секунд", "38 секунд", "39 секунд", "40 секунд", "41 секунда", "42 секунды", "43 секунды", "44 секунды", "45 секунд", "46 секунд", "47 секунд", "48 секунд", "49 секунд", "50 секунд", "51 секунда", "52 секунды", "53 секунды", "54 секунды", "55 секунды", "56 секунд", "57 секунд", "58 секунд", "59 секунд", "60 секунд"];
  return mySeconds[myDate.getSeconds()];
}

function myDateRussian() {
  // 1 минут[а], 2 минут[ы], 5 минут[] - нужно по аналогии с секундами и часами сделать функцию, которая будет возвращать верную форму слова.
  alert('Сегодня ' + myDate.getDate() + ' ' + getRussianMonth() + ' ' +   myDate.getFullYear() + ' ' + 'года, ' + getRussianDay() + ', ' + getMyHours() + ' ' + myDate.getMinutes() + ' минут ' + getMySeconds() );

  // В таких конструкциях очень рекомендую задавать строки с использованием таких `` кавычек
  // Подробнее про них можно почитать тут:
  // https://learn.javascript.ru/string
  //
  // Тогда запись будет выглядеть локаничнее:
  // alert(`Сегодня ${myDate.getDate()} ${getRussianMonth()} ${myDate.getFullYear()} года, ${getRussianDay()}, ${getMyHours()} ${myDate.getMinutes()} минут ${getMySeconds()}`);
}

myDateRussian();
